In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

# Question 1

In [2]:
A= [1,2,3,4,5,6]
B= [13,21,34]

#merging both list together to create single list 

A.extend(B)
A

[1, 2, 3, 4, 5, 6, 13, 21, 34]

# Question 2

In [3]:
#creating an identity matrix 

np.identity(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

# Question 3

In [4]:
#reading the dataset to be used (in excel format)

fuel_data = pd.read_excel(r'C:\Users\solas\Downloads\fuel_ferc1.xlsx')
fuel_data

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533,1.000,2.77,2.77,2.570
...,...,...,...,...,...,...,...,...,...,...,...
29518,f1_fuel_2018_12_12_0_13,12,2018,neil simpson ct #1,gas,mcf,18799,1.059,4.78,4.78,9.030
29519,f1_fuel_2018_12_12_1_1,12,2018,cheyenne prairie 58%,gas,mcf,806730,1.050,3.65,3.65,6.950
29520,f1_fuel_2018_12_12_1_10,12,2018,lange ct facility,gas,mcf,104554,1.060,4.77,4.77,8.990
29521,f1_fuel_2018_12_12_1_13,12,2018,wygen 3 bhp 52%,coal,ton,315945,16.108,3.06,14.76,1.110
29522,f1_fuel_2018_12_12_1_14,12,2018,wygen 3 bhp 52%,gas,mcf,17853,1.059,0.00,0.00,11.680

In [5]:
#Grouping according to the required column to get desired average 
#using the groupby() function
#using the sort_value() to get the result in an assending order

Average = fuel_data.groupby('fuel_type_code_pudl')['fuel_cost_per_unit_burned'].mean()
Average.sort_values()

fuel_type_code_pudl
gas          13.659397
other        18.253856
waste        19.518122
coal         67.421830
oil         168.877086
nuclear    4955.157002
Name: fuel_cost_per_unit_burned, dtype: float64

In [6]:
#result shows the Fuel_type_code with the loewst average cost is "GAS"

# Question 4

In [7]:
#To calculate the standard deviation 
#we need to get the overview of the required coloum using the describe() function 

fuel_data['fuel_mmbtu_per_unit'].describe()

count    29523.000000
mean         8.492111
std         10.600220
min          0.000001
25%          1.024000
50%          5.762694
75%         17.006000
max        341.260000
Name: fuel_mmbtu_per_unit, dtype: float64

In [8]:
Statistics = fuel_data['fuel_mmbtu_per_unit'].describe()
Statistics

count    29523.000000
mean         8.492111
std         10.600220
min          0.000001
25%          1.024000
50%          5.762694
75%         17.006000
max        341.260000
Name: fuel_mmbtu_per_unit, dtype: float64

In [9]:
Standard_Deviation = round(Statistics.loc['std'], 2)
print('Standard_Deviation is', Standard_Deviation)

Standard_Deviation is 10.6

In [10]:
my_75 = round(Statistics.loc['75%'], 2)
print('My 75th percentage is', my_75)

My 75th percentage is 17.01

# Question 5

In [11]:
from scipy.stats import skew, kurtosis

In [12]:
fuel_data.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533,1.000,2.77,2.77,2.570

In [13]:
skew = round(skew(fuel_data['fuel_qty_burned']), 2)
skew

15.85

In [14]:
kurtoisis = round(kurtosis(fuel_data['fuel_qty_burned']), 2)
kurtoisis

651.26

# Question 6

In [15]:
#To get the feature of missing values
#we use the isnull () function for the data set 

missing = fuel_data.isnull()
missing

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
29518,False,False,False,False,False,False,False,False,False,False,False
29519,False,False,False,False,False,False,False,False,False,False,False
29520,False,False,False,False,False,False,False,False,False,False,False
29521,False,False,False,False,False,False,False,False,False,False,False
29522,False,False,False,False,False,False,False,False,False,False,False

In [16]:
#To get the total number of missing value, we use the sun() function

Sum = missing.sum()
Sum
#the column with missing value is fuel_unit 
#Total number of missing rolls is 180

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [17]:
#percentage of missing rows as a factor of the total number of rows
#Using the round() function to get the required decemial point 

round(((180/len(fuel_data))*100), 3)

0.61

In [18]:
#To get where the features with missing values fall 

len(fuel_data)

29523

In [19]:
fuel_data.shape

(29523, 11)

In [20]:
fuel_data['fuel_unit'].unique()

array(['ton', 'mcf', 'kgU', 'bbl', 'gramsU', nan, 'mwdth', 'mmbtu',
       'mwhth', 'gal'], dtype=object)

# Question 8

In [21]:
fuel_data.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533,1.000,2.77,2.77,2.570

In [22]:
#getting the fuel per unit

lowest= fuel_data.corr()['fuel_cost_per_unit_burned']
lowest

utility_id_ferc1               -0.037863
report_year                     0.013599
fuel_qty_burned                -0.018535
fuel_mmbtu_per_unit            -0.010034
fuel_cost_per_unit_burned       1.000000
fuel_cost_per_unit_delivered    0.011007
fuel_cost_per_mmbtu            -0.000437
Name: fuel_cost_per_unit_burned, dtype: float64

In [23]:
#the get the second and third lowest corrolation 
#we will arrange in ascending order, we make use of the sort_value() function

lowest.sort_values()

utility_id_ferc1               -0.037863
fuel_qty_burned                -0.018535
fuel_mmbtu_per_unit            -0.010034
fuel_cost_per_mmbtu            -0.000437
fuel_cost_per_unit_delivered    0.011007
report_year                     0.013599
fuel_cost_per_unit_burned       1.000000
Name: fuel_cost_per_unit_burned, dtype: float64

# Question 9

In [24]:
#percentage change in the fuel coast 
#using the group by() function to identify the needed coloumn

fuel_data.groupby('report_year', as_index= False)['fuel_cost_per_unit_delivered']\
.mean().sort_values('fuel_cost_per_unit_delivered', ascending = False)

    report_year  fuel_cost_per_unit_delivered
3          1997                  11140.197239
2          1996                   9196.705948
6          2000                    985.362877
15         2009                    652.694163
24         2018                    499.269966
21         2015                    326.535511
4          1998                    287.154420
20         2014                    192.737183
19         2013                    172.307591
10         2004                    139.524275
22         2016                    103.901761
16         2010                     91.862105
0          1994                     63.636060
18         2012                     60.994502
7          2001                     60.050396
17         2011                     59.774667
14         2008                     58.588197
9          2003                     55.663493
8          2002                     47.594361
23         2017                     46.196861
13         2007                     43.325023
11         2005                     41.438184
12         2006                     38.657484
1          1995                     32.735269
5          1999                     25.551627

In [25]:
#to calculate the percentage change in the fuel cost per unit burned in 1998 compared to 1994?

the_year_1998 = fuel_data[(fuel_data['report_year'] == 1998) & (fuel_data['fuel_type_code_pudl'] == 'coal')]

In [26]:
the_year_1994 = fuel_data[(fuel_data['report_year'] == 1994) & (fuel_data['fuel_type_code_pudl'] == 'coal')]

In [27]:
the_year_1998.shape

(431, 11)

In [28]:
the_year_1994.shape

(475, 11)

In [29]:
#to get the cost spent in each year 

the_year_1994_cost  = the_year_1994['fuel_cost_per_unit_burned'].sum()
the_year_1994_cost

14984.572

In [30]:
the_year_1998_cost = the_year_1998['fuel_cost_per_unit_burned'].sum()
the_year_1998_cost

11902.597

In [35]:
((the_year_1998_cost  - the_year_1994_cost ) / the_year_1994_cost) * 100

-20.567654518260518

# Question 10

In [36]:
#searhing the year with the highest average full cost per unit delieverd 

fuel_data.groupby('report_year', as_index= False)['fuel_cost_per_unit_delivered']\
.mean().sort_values('fuel_cost_per_unit_delivered', ascending = False)

    report_year  fuel_cost_per_unit_delivered
3          1997                  11140.197239
2          1996                   9196.705948
6          2000                    985.362877
15         2009                    652.694163
24         2018                    499.269966
21         2015                    326.535511
4          1998                    287.154420
20         2014                    192.737183
19         2013                    172.307591
10         2004                    139.524275
22         2016                    103.901761
16         2010                     91.862105
0          1994                     63.636060
18         2012                     60.994502
7          2001                     60.050396
17         2011                     59.774667
14         2008                     58.588197
9          2003                     55.663493
8          2002                     47.594361
23         2017                     46.196861
13         2007                     43.325023
11         2005                     41.438184
12         2006                     38.657484
1          1995                     32.735269
5          1999                     25.551627

In [ ]:
#with the arrangment of the table, we were able to easily pick 1997 as the highest year